IDEA Open Model
Loading Class
Compatible with IDEA StatiCa 20.1
 Loading identification
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.Loading
 IdeaRS.OpenModel.Result.ResultOfLoading
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class Loading
Public Class Loading
The Loading type exposes the following members.
Constructors
Name | Description
Loading()
 Constructor
Loading(LoadingType, Int32)
 Constructor
Top
Properties
Name | Description
Id
 Id of loading
LoadingType
 Type of loading
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace